apache/nuttx/arch/arm/include/lpc17xx_40xx/chip.h
#  undef  LPC176x                      /* Not LPC175/6 family */
#  define LPC178x_40xx              1  /* LPC177/8 or LPC40xx family */
#  define LPC17_40_FLASH_SIZE       (256*1024) /* 256Kb */
#  define LPC17_40_SRAM_SIZE        (80*1024)  /*  80Kb */
#  define LPC17_40_CPUSRAM_SIZE     (64*1024)
#  define LPC17_40_HAVE_BANK0       1  /* Have Peripheral SRAM bank 0  */
#  undef  LPC17_40_HAVE_BANK1          /* Have Peripheral SRAM bank 1 */
#  define LPC17_40_NETHCONTROLLERS  1  /* One Ethernet controller */
#  define LPC17_40_NUSBHOST         1  /* One USB host controller */
#  define LPC17_40_NUSBOTG          1  /* One USB OTG controller */
#  define LPC17_40_NUSBDEV          1  /* One USB device controller */
#  define LPC17_40_HAVE_SPIFI       1  /* Have SPIFI interface */
#  undef  LPC17_40_HAVE_LCD            /* No LCD controller */
#  define LPC17_40_HAVE_QEI         1  /* One QEI interface */
#  define LPC17_40_HAVE_SD          1  /* One SD controller */
#elif defined(CONFIG_ARCH_CHIP_LPC4078)
#  undef  LPC176x                      /* Not LPC175/6 family */
#  define LPC178x_40xx              1  /* LPC177/8 or LPC40xx family */
#  define LPC17_40_FLASH_SIZE       (512*1024) /* 512Kb */
#  define LPC17_40_SRAM_SIZE        (96*1024)  /*  96Kb */
#  define LPC17_40_CPUSRAM_SIZE     (64*1024)
#  define LPC17_40_HAVE_BANK0       1  /* Have Peripheral SRAM bank 0 */
#  define LPC17_40_HAVE_BANK1       1  /* Have Peripheral SRAM bank 1 */
#  define LPC17_40_NETHCONTROLLERS  1  /* One Ethernet controller */
#  define LPC17_40_NUSBHOST         1  /* One USB host controller */
#  define LPC17_40_NUSBOTG          1  /* One USB OTG controller */
#  define LPC17_40_NUSBDEV          1  /* One USB device controller */
#  define LPC17_40_HAVE_SPIFI       1  /* Have SPIFI interface */
#  undef  LPC17_40_HAVE_LCD            /* No LCD controller */
#  define LPC17_40_HAVE_QEI         1  /* One QEI interface */
#  define LPC17_40_HAVE_SD          1  /* One SD controller */
#elif defined(CONFIG_ARCH_CHIP_LPC4088)
#  undef  LPC176x                      /* Not LPC175/6 family */
#  define LPC178x_40xx              1  /* LPC177/8 or LPC40xx family */
#  define LPC17_40_FLASH_SIZE       (512*1024) /* 512Kb */
#  define LPC17_40_SRAM_SIZE        (96*1024)  /*  64Kb */
#  define LPC17_40_CPUSRAM_SIZE     (64*1024)
#  define LPC17_40_HAVE_BANK0       1  /* Have Peripheral SRAM bank 0 */
#  define LPC17_40_HAVE_BANK1       1  /* Have Peripheral SRAM bank 1 */
#  define LPC17_40_NETHCONTROLLERS  1  /* One Ethernet controller */
#  define LPC17_40_NUSBHOST         1  /* One USB host controller */
#  define LPC17_40_NUSBOTG          1  /* One USB OTG controller */
#  define LPC17_40_NUSBDEV          1  /* One USB device controller */
#  define LPC17_40_HAVE_SPIFI       1  /* Have SPIFI interface */
#  define LPC17_40_HAVE_LCD         1  /* One LCD controller */
#  define LPC17_40_HAVE_QEI         1  /* One QEI interface */
#  define LPC17_40_HAVE_SD          1  /* One SD controller */
#else
#  error "Unsupported LPC17xx/LPC40xx chip"
#endif

/* NVIC priority levels *************************************************************/
/* Each priority field holds a priority value, 0-31. The lower the value, the greater
 * the priority of the corresponding interrupt. The processor implements only
 * bits[7:3] of each field, bits[2:0] read as zero and ignore writes.
 */

#define NVIC_SYSH_PRIORITY_MIN     0xf8 /* All bits[7:3] set is minimum priority */
#define NVIC_SYSH_PRIORITY_DEFAULT 0x80 /* Midpoint is the default */
#define NVIC_SYSH_PRIORITY_MAX     0x00 /* Zero is maximum priority */
#define NVIC_SYSH_PRIORITY_STEP    0x08 /* Five bits of interrupt priority used */

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/************************************************************************************
 * Public Functions
 ************************************************************************************/

#endif /* __ARCH_ARM_INCLUDE_LPC17XX_40XX_CHIP_H */
